---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ModelAccessValidationService
source: html/9892a90c-e362-beb8-264e-94dc9e9ab88e.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ModelAccessValidationService Property

The external service which validates the access to Revit model such as Revit Cloud model.

## Syntax (C#)
```csharp
public static ExternalServiceId ModelAccessValidationService { get; }
```